; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob41) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 crate15 crate16 crate17 crate18 crate19 crate20 crate21 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 hoist14 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate14)
	(at pallet3 distributor0)
	(clear crate1)
	(at pallet4 distributor1)
	(clear crate7)
	(at pallet5 distributor2)
	(clear crate21)
	(at pallet6 depot1)
	(clear crate13)
	(at pallet7 distributor2)
	(clear crate20)
	(at pallet8 depot0)
	(clear pallet8)
	(at pallet9 distributor1)
	(clear crate19)
	(at pallet10 distributor1)
	(clear crate11)
	(at pallet11 distributor0)
	(clear crate0)
	(at pallet12 distributor1)
	(clear crate15)
	(at pallet13 distributor1)
	(clear crate3)
	(at pallet14 distributor0)
	(clear crate16)
	(at truck0 distributor0)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 depot1)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 depot1)
	(available hoist10)
	(at hoist11 distributor2)
	(available hoist11)
	(at hoist12 depot1)
	(available hoist12)
	(at hoist13 distributor1)
	(available hoist13)
	(at hoist14 distributor0)
	(available hoist14)
	(at crate0 distributor0)
	(on crate0 pallet11)
	(at crate1 distributor0)
	(on crate1 pallet3)
	(at crate2 distributor2)
	(on crate2 pallet5)
	(at crate3 distributor1)
	(on crate3 pallet13)
	(at crate4 depot0)
	(on crate4 pallet0)
	(at crate5 distributor1)
	(on crate5 pallet12)
	(at crate6 depot0)
	(on crate6 crate4)
	(at crate7 distributor1)
	(on crate7 pallet4)
	(at crate8 distributor2)
	(on crate8 pallet7)
	(at crate9 depot2)
	(on crate9 pallet2)
	(at crate10 distributor1)
	(on crate10 pallet10)
	(at crate11 distributor1)
	(on crate11 crate10)
	(at crate12 depot2)
	(on crate12 crate9)
	(at crate13 depot1)
	(on crate13 pallet6)
	(at crate14 depot2)
	(on crate14 crate12)
	(at crate15 distributor1)
	(on crate15 crate5)
	(at crate16 distributor0)
	(on crate16 pallet14)
	(at crate17 distributor2)
	(on crate17 crate2)
	(at crate18 distributor2)
	(on crate18 crate8)
	(at crate19 distributor1)
	(on crate19 pallet9)
	(at crate20 distributor2)
	(on crate20 crate18)
	(at crate21 distributor2)
	(on crate21 crate17)
)

(:goal (and
		(on crate0 crate12)
		(on crate1 pallet6)
		(on crate2 crate18)
		(on crate3 pallet3)
		(on crate4 crate1)
		(on crate5 crate14)
		(on crate6 pallet0)
		(on crate7 pallet1)
		(on crate8 crate17)
		(on crate9 crate7)
		(on crate10 crate13)
		(on crate11 pallet12)
		(on crate12 pallet11)
		(on crate13 pallet8)
		(on crate14 pallet9)
		(on crate15 pallet10)
		(on crate16 crate8)
		(on crate17 pallet5)
		(on crate18 crate9)
		(on crate19 pallet2)
		(on crate20 crate10)
		(on crate21 crate6)
	)
))

; plan
1. (lift hoist3 crate0 pallet11 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet11)
   added: (lifting hoist3 crate0) (clear pallet11)
   goals met: 0 of 22
2. (load hoist3 crate0 truck0 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck0) (available hoist3)
   goals met: 0 of 22
3. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 0 of 22
4. (lift hoist9 crate11 crate10 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist9) (on crate11 crate10)
   added: (lifting hoist9 crate11) (clear crate10)
   goals met: 0 of 22
5. (lift hoist13 crate15 crate5 distributor1)
   deleted: (at crate15 distributor1) (clear crate15) (available hoist13) (on crate15 crate5)
   added: (lifting hoist13 crate15) (clear crate5)
   goals met: 0 of 22
6. (lift hoist3 crate16 pallet14 distributor0)
   deleted: (at crate16 distributor0) (clear crate16) (available hoist3) (on crate16 pallet14)
   added: (lifting hoist3 crate16) (clear pallet14)
   goals met: 0 of 22
7. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 22
8. (load hoist3 crate16 truck1 distributor0)
   deleted: (lifting hoist3 crate16)
   added: (in crate16 truck1) (available hoist3)
   goals met: 0 of 22
9. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 0 of 22
10. (unload hoist5 crate16 truck1 distributor2)
   deleted: (in crate16 truck1) (available hoist5)
   added: (lifting hoist5 crate16)
   goals met: 0 of 22
11. (lift hoist7 crate6 crate4 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist7) (on crate6 crate4)
   added: (lifting hoist7 crate6) (clear crate4)
   goals met: 0 of 22
12. (lift hoist6 crate4 pallet0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist6) (on crate4 pallet0)
   added: (lifting hoist6 crate4) (clear pallet0)
   goals met: 0 of 22
13. (drop hoist7 crate6 pallet0 depot0)
   deleted: (lifting hoist7 crate6) (clear pallet0)
   added: (available hoist7) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 1 of 22
14. (lift hoist3 crate1 pallet3 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist3) (on crate1 pallet3)
   added: (lifting hoist3 crate1) (clear pallet3)
   goals met: 1 of 22
15. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 1 of 22
16. (load hoist3 crate1 truck1 distributor0)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck1) (available hoist3)
   goals met: 1 of 22
17. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 1 of 22
18. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 1 of 22
19. (unload hoist8 crate1 truck1 depot1)
   deleted: (in crate1 truck1) (available hoist8)
   added: (lifting hoist8 crate1)
   goals met: 1 of 22
20. (lift hoist12 crate13 pallet6 depot1)
   deleted: (at crate13 depot1) (clear crate13) (available hoist12) (on crate13 pallet6)
   added: (lifting hoist12 crate13) (clear pallet6)
   goals met: 1 of 22
21. (load hoist12 crate13 truck1 depot1)
   deleted: (lifting hoist12 crate13)
   added: (in crate13 truck1) (available hoist12)
   goals met: 1 of 22
22. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 1 of 22
23. (unload hoist7 crate13 truck1 depot0)
   deleted: (in crate13 truck1) (available hoist7)
   added: (lifting hoist7 crate13)
   goals met: 1 of 22
24. (load hoist6 crate4 truck1 depot0)
   deleted: (lifting hoist6 crate4)
   added: (in crate4 truck1) (available hoist6)
   goals met: 1 of 22
25. (drop hoist7 crate13 pallet8 depot0)
   deleted: (lifting hoist7 crate13) (clear pallet8)
   added: (available hoist7) (at crate13 depot0) (clear crate13) (on crate13 pallet8)
   goals met: 2 of 22
26. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 2 of 22
27. (unload hoist12 crate4 truck1 depot1)
   deleted: (in crate4 truck1) (available hoist12)
   added: (lifting hoist12 crate4)
   goals met: 2 of 22
28. (drop hoist8 crate1 pallet6 depot1)
   deleted: (lifting hoist8 crate1) (clear pallet6)
   added: (available hoist8) (at crate1 depot1) (clear crate1) (on crate1 pallet6)
   goals met: 3 of 22
29. (drop hoist12 crate4 crate1 depot1)
   deleted: (lifting hoist12 crate4) (clear crate1)
   added: (available hoist12) (at crate4 depot1) (clear crate4) (on crate4 crate1)
   goals met: 4 of 22
30. (lift hoist2 crate14 crate12 depot2)
   deleted: (at crate14 depot2) (clear crate14) (available hoist2) (on crate14 crate12)
   added: (lifting hoist2 crate14) (clear crate12)
   goals met: 4 of 22
31. (load hoist2 crate14 truck0 depot2)
   deleted: (lifting hoist2 crate14)
   added: (in crate14 truck0) (available hoist2)
   goals met: 4 of 22
32. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 4 of 22
33. (unload hoist4 crate14 truck0 distributor1)
   deleted: (in crate14 truck0) (available hoist4)
   added: (lifting hoist4 crate14)
   goals met: 4 of 22
34. (load hoist9 crate11 truck0 distributor1)
   deleted: (lifting hoist9 crate11)
   added: (in crate11 truck0) (available hoist9)
   goals met: 4 of 22
35. (lift hoist2 crate12 crate9 depot2)
   deleted: (at crate12 depot2) (clear crate12) (available hoist2) (on crate12 crate9)
   added: (lifting hoist2 crate12) (clear crate9)
   goals met: 4 of 22
36. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 4 of 22
37. (load hoist2 crate12 truck1 depot2)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck1) (available hoist2)
   goals met: 4 of 22
38. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 4 of 22
39. (unload hoist3 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist3)
   added: (lifting hoist3 crate12)
   goals met: 4 of 22
40. (drop hoist3 crate12 pallet11 distributor0)
   deleted: (lifting hoist3 crate12) (clear pallet11)
   added: (available hoist3) (at crate12 distributor0) (clear crate12) (on crate12 pallet11)
   goals met: 5 of 22
41. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 5 of 22
42. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   goals met: 5 of 22
43. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 5 of 22
44. (drop hoist3 crate0 crate12 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate12)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate12)
   goals met: 6 of 22
45. (lift hoist2 crate9 pallet2 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist2) (on crate9 pallet2)
   added: (lifting hoist2 crate9) (clear pallet2)
   goals met: 6 of 22
46. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 6 of 22
47. (load hoist2 crate9 truck0 depot2)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   goals met: 6 of 22
48. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 6 of 22
49. (lift hoist9 crate10 pallet10 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist9) (on crate10 pallet10)
   added: (lifting hoist9 crate10) (clear pallet10)
   goals met: 6 of 22
50. (load hoist9 crate10 truck0 distributor1)
   deleted: (lifting hoist9 crate10)
   added: (in crate10 truck0) (available hoist9)
   goals met: 6 of 22
51. (drop hoist13 crate15 pallet10 distributor1)
   deleted: (lifting hoist13 crate15) (clear pallet10)
   added: (available hoist13) (at crate15 distributor1) (clear crate15) (on crate15 pallet10)
   goals met: 7 of 22
52. (unload hoist9 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist9)
   added: (lifting hoist9 crate9)
   goals met: 7 of 22
53. (drop hoist9 crate9 crate7 distributor1)
   deleted: (lifting hoist9 crate9) (clear crate7)
   added: (available hoist9) (at crate9 distributor1) (clear crate9) (on crate9 crate7)
   goals met: 8 of 22
54. (lift hoist9 crate19 pallet9 distributor1)
   deleted: (at crate19 distributor1) (clear crate19) (available hoist9) (on crate19 pallet9)
   added: (lifting hoist9 crate19) (clear pallet9)
   goals met: 8 of 22
55. (load hoist9 crate19 truck0 distributor1)
   deleted: (lifting hoist9 crate19)
   added: (in crate19 truck0) (available hoist9)
   goals met: 8 of 22
56. (unload hoist9 crate11 truck0 distributor1)
   deleted: (in crate11 truck0) (available hoist9)
   added: (lifting hoist9 crate11)
   goals met: 8 of 22
57. (drop hoist4 crate14 pallet9 distributor1)
   deleted: (lifting hoist4 crate14) (clear pallet9)
   added: (available hoist4) (at crate14 distributor1) (clear crate14) (on crate14 pallet9)
   goals met: 9 of 22
58. (lift hoist4 crate3 pallet13 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 pallet13)
   added: (lifting hoist4 crate3) (clear pallet13)
   goals met: 9 of 22
59. (load hoist4 crate3 truck0 distributor1)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck0) (available hoist4)
   goals met: 9 of 22
60. (lift hoist4 crate5 pallet12 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 pallet12)
   added: (lifting hoist4 crate5) (clear pallet12)
   goals met: 9 of 22
61. (drop hoist9 crate11 pallet12 distributor1)
   deleted: (lifting hoist9 crate11) (clear pallet12)
   added: (available hoist9) (at crate11 distributor1) (clear crate11) (on crate11 pallet12)
   goals met: 10 of 22
62. (drop hoist4 crate5 crate14 distributor1)
   deleted: (lifting hoist4 crate5) (clear crate14)
   added: (available hoist4) (at crate5 distributor1) (clear crate5) (on crate5 crate14)
   goals met: 11 of 22
63. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 11 of 22
64. (unload hoist7 crate10 truck0 depot0)
   deleted: (in crate10 truck0) (available hoist7)
   added: (lifting hoist7 crate10)
   goals met: 11 of 22
65. (drop hoist7 crate10 crate13 depot0)
   deleted: (lifting hoist7 crate10) (clear crate13)
   added: (available hoist7) (at crate10 depot0) (clear crate10) (on crate10 crate13)
   goals met: 12 of 22
66. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 12 of 22
67. (unload hoist2 crate19 truck0 depot2)
   deleted: (in crate19 truck0) (available hoist2)
   added: (lifting hoist2 crate19)
   goals met: 12 of 22
68. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 12 of 22
69. (unload hoist3 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist3)
   added: (lifting hoist3 crate3)
   goals met: 12 of 22
70. (drop hoist2 crate19 pallet2 depot2)
   deleted: (lifting hoist2 crate19) (clear pallet2)
   added: (available hoist2) (at crate19 depot2) (clear crate19) (on crate19 pallet2)
   goals met: 13 of 22
71. (drop hoist3 crate3 pallet3 distributor0)
   deleted: (lifting hoist3 crate3) (clear pallet3)
   added: (available hoist3) (at crate3 distributor0) (clear crate3) (on crate3 pallet3)
   goals met: 14 of 22
72. (lift hoist9 crate9 crate7 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist9) (on crate9 crate7)
   added: (lifting hoist9 crate9) (clear crate7)
   goals met: 13 of 22
73. (lift hoist4 crate7 pallet4 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 pallet4)
   added: (lifting hoist4 crate7) (clear pallet4)
   goals met: 13 of 22
74. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 13 of 22
75. (load hoist4 crate7 truck0 distributor1)
   deleted: (lifting hoist4 crate7)
   added: (in crate7 truck0) (available hoist4)
   goals met: 13 of 22
76. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 13 of 22
77. (unload hoist8 crate7 truck0 depot1)
   deleted: (in crate7 truck0) (available hoist8)
   added: (lifting hoist8 crate7)
   goals met: 13 of 22
78. (drop hoist8 crate7 pallet1 depot1)
   deleted: (lifting hoist8 crate7) (clear pallet1)
   added: (available hoist8) (at crate7 depot1) (clear crate7) (on crate7 pallet1)
   goals met: 14 of 22
79. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 14 of 22
80. (load hoist9 crate9 truck0 distributor1)
   deleted: (lifting hoist9 crate9)
   added: (in crate9 truck0) (available hoist9)
   goals met: 14 of 22
81. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 14 of 22
82. (unload hoist8 crate9 truck0 depot1)
   deleted: (in crate9 truck0) (available hoist8)
   added: (lifting hoist8 crate9)
   goals met: 14 of 22
83. (drop hoist8 crate9 crate7 depot1)
   deleted: (lifting hoist8 crate9) (clear crate7)
   added: (available hoist8) (at crate9 depot1) (clear crate9) (on crate9 crate7)
   goals met: 15 of 22
84. (lift hoist11 crate20 crate18 distributor2)
   deleted: (at crate20 distributor2) (clear crate20) (available hoist11) (on crate20 crate18)
   added: (lifting hoist11 crate20) (clear crate18)
   goals met: 15 of 22
85. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 15 of 22
86. (load hoist5 crate16 truck1 distributor2)
   deleted: (lifting hoist5 crate16)
   added: (in crate16 truck1) (available hoist5)
   goals met: 15 of 22
87. (load hoist11 crate20 truck1 distributor2)
   deleted: (lifting hoist11 crate20)
   added: (in crate20 truck1) (available hoist11)
   goals met: 15 of 22
88. (lift hoist5 crate21 crate17 distributor2)
   deleted: (at crate21 distributor2) (clear crate21) (available hoist5) (on crate21 crate17)
   added: (lifting hoist5 crate21) (clear crate17)
   goals met: 15 of 22
89. (load hoist5 crate21 truck1 distributor2)
   deleted: (lifting hoist5 crate21)
   added: (in crate21 truck1) (available hoist5)
   goals met: 15 of 22
90. (unload hoist5 crate16 truck1 distributor2)
   deleted: (in crate16 truck1) (available hoist5)
   added: (lifting hoist5 crate16)
   goals met: 15 of 22
91. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 15 of 22
92. (unload hoist7 crate20 truck1 depot0)
   deleted: (in crate20 truck1) (available hoist7)
   added: (lifting hoist7 crate20)
   goals met: 15 of 22
93. (unload hoist6 crate21 truck1 depot0)
   deleted: (in crate21 truck1) (available hoist6)
   added: (lifting hoist6 crate21)
   goals met: 15 of 22
94. (drop hoist7 crate20 crate10 depot0)
   deleted: (lifting hoist7 crate20) (clear crate10)
   added: (available hoist7) (at crate20 depot0) (clear crate20) (on crate20 crate10)
   goals met: 16 of 22
95. (drop hoist6 crate21 crate6 depot0)
   deleted: (lifting hoist6 crate21) (clear crate6)
   added: (available hoist6) (at crate21 depot0) (clear crate21) (on crate21 crate6)
   goals met: 17 of 22
96. (lift hoist11 crate18 crate8 distributor2)
   deleted: (at crate18 distributor2) (clear crate18) (available hoist11) (on crate18 crate8)
   added: (lifting hoist11 crate18) (clear crate8)
   goals met: 17 of 22
97. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 17 of 22
98. (load hoist5 crate16 truck1 distributor2)
   deleted: (lifting hoist5 crate16)
   added: (in crate16 truck1) (available hoist5)
   goals met: 17 of 22
99. (load hoist11 crate18 truck1 distributor2)
   deleted: (lifting hoist11 crate18)
   added: (in crate18 truck1) (available hoist11)
   goals met: 17 of 22
100. (unload hoist5 crate16 truck1 distributor2)
   deleted: (in crate16 truck1) (available hoist5)
   added: (lifting hoist5 crate16)
   goals met: 17 of 22
101. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 17 of 22
102. (unload hoist8 crate18 truck1 depot1)
   deleted: (in crate18 truck1) (available hoist8)
   added: (lifting hoist8 crate18)
   goals met: 17 of 22
103. (drop hoist8 crate18 crate9 depot1)
   deleted: (lifting hoist8 crate18) (clear crate9)
   added: (available hoist8) (at crate18 depot1) (clear crate18) (on crate18 crate9)
   goals met: 18 of 22
104. (drop hoist5 crate16 crate8 distributor2)
   deleted: (lifting hoist5 crate16) (clear crate8)
   added: (available hoist5) (at crate16 distributor2) (clear crate16) (on crate16 crate8)
   goals met: 19 of 22
105. (lift hoist11 crate17 crate2 distributor2)
   deleted: (at crate17 distributor2) (clear crate17) (available hoist11) (on crate17 crate2)
   added: (lifting hoist11 crate17) (clear crate2)
   goals met: 19 of 22
106. (lift hoist5 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet5)
   added: (lifting hoist5 crate2) (clear pallet5)
   goals met: 19 of 22
107. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 19 of 22
108. (load hoist5 crate2 truck1 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck1) (available hoist5)
   goals met: 19 of 22
109. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 19 of 22
110. (unload hoist8 crate2 truck1 depot1)
   deleted: (in crate2 truck1) (available hoist8)
   added: (lifting hoist8 crate2)
   goals met: 19 of 22
111. (drop hoist11 crate17 pallet5 distributor2)
   deleted: (lifting hoist11 crate17) (clear pallet5)
   added: (available hoist11) (at crate17 distributor2) (clear crate17) (on crate17 pallet5)
   goals met: 20 of 22
112. (drop hoist8 crate2 crate18 depot1)
   deleted: (lifting hoist8 crate2) (clear crate18)
   added: (available hoist8) (at crate2 depot1) (clear crate2) (on crate2 crate18)
   goals met: 21 of 22
113. (lift hoist11 crate16 crate8 distributor2)
   deleted: (at crate16 distributor2) (clear crate16) (available hoist11) (on crate16 crate8)
   added: (lifting hoist11 crate16) (clear crate8)
   goals met: 20 of 22
114. (lift hoist5 crate8 pallet7 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 pallet7)
   added: (lifting hoist5 crate8) (clear pallet7)
   goals met: 20 of 22
115. (drop hoist5 crate8 crate17 distributor2)
   deleted: (lifting hoist5 crate8) (clear crate17)
   added: (available hoist5) (at crate8 distributor2) (clear crate8) (on crate8 crate17)
   goals met: 21 of 22
116. (drop hoist11 crate16 crate8 distributor2)
   deleted: (lifting hoist11 crate16) (clear crate8)
   added: (available hoist11) (at crate16 distributor2) (clear crate16) (on crate16 crate8)
   goals met: 22 of 22
